Repository: guni12/siteshop
Catalog: language/*/LC_MESSAGES/siteshop.po
Languages: sv

source: Home
sv: Hem

source: Modules
sv: Moduler

source: Content
sv: Innehåll

source: About Me
sv: Om mig

source: My blog
sv: Min blogg

source: Guestbook
sv: Gästbok

source: Login
sv: Logga in

source: Logout
sv: Logga ut

source: User control panel
sv: Kontrollpanelen

source: Admin control panel
sv: Admin kontrollpanel

source: Overview
sv: Översikt

source: Profile
sv: Profil

source: Groups
sv: Grupper

source: Mail
sv: Email

source: Password
sv: Lösenord

source: A PHP-based MVC-inspired CMF
sv: Ett PHP-baserat MVC-inspirerat CMF

source: <p>Siteshop &copy; by Gunvor Nilsson (student at BTH)</p>
sv: <p>Siteshop &copy; av Gunvor Nilsson (student vid BTH)</p>

source: Daddys workshop
sv: Pappas snickarbod

source: My dad's workshop before he passed away
sv: Min pappas hobbyverkstad efter ett väl levt liv.

source: About me
sv: Om mig

source: Older articles
sv: Äldre artiklar

source: The Siteshop Blog
sv: Siteshop Bloggen

source: One post
sv: Ett inlägg

source: My Guestbook
sv: Min gästbok

source: Update
sv: Uppdatera

source: Create
sv: Skapa

source: Secretside
sv: Hemliga sidan

source: update
sv: uppdatera

source: add
sv: Skicka

source: Add entry:
sv: Skriv ett inlägg.

source: Write something here.
sv: Välkommen att skriva här.

source: Latest messages
sv: Senaste inläggen här.

source: Updated at
sv: Uppdaterad

source: Update or delete content
sv: Ändra eller ta bort innehåll

source: ACP: Admin Control Panel
sv: AKP: Administratörens KontrollPanel

source: Here you can create and edit
sv: Här kan du skapa och uppdatera

source: The blogs
sv: Bloggarna

source: The pages
sv: Första sidan

source: Actions
sv: Skapa

source: The users
sv: Användare

source: The groups
sv: Grupper

source: a user or group or edit content in pages and blog. You can also delete the whole guestbook if needed.
sv: en användare eller grupp och uppdatera sidor och bloggar. Du kan också slänga hela eller delar av gästboken om det skulle behövas.

source: Create new content
sv: Skapa nytt innehåll

source: Acronym
sv: Akronym

source: Name
sv: Namn

source: Algorithm
sv: Algoritm

source: Created
sv: Skapad

source: Updated
sv: Ändrad

source: Edit member
sv: Ändra medlem

source: Edit joins
sv: Ändra samband

source: Edit
sv: Ändra

source: GroupEdit
sv: Fixa

source: The secrets
sv: Hemligheterna

source: The guestbook can be deleted here:
sv: Ta bort alla gästbokens inlägg:

source: Create a new member
sv: Skapa ny medlem

source: Create a new group
sv: Skapa ny grupp

source: Initiate the database here:
sv: Initiera databasen här.

source: Delete the guestbook
sv: Släng&nbsp;gästboken

source: Create user
sv: Skapa användare

source: Create group
sv: Skapa grupp

source: Init database, create tables and create default admin user
sv: Initiera databasen, skapa tabeller och skapa användare.

source: Password:
sv: Lösenord

source: Password again:
sv: Lösenord igen:

source: DoCreate
sv: Skicka

source: The CreateUserForm could not be processed.
sv: Formuläret för att skapa användare kunde inte processas.

source: Create a new user here:
sv: Skapa en ny användare här

source: Title:
sv: Titel

source: Key
sv: Nyckel

source: Content:
sv: Innehåll

source: Type:
sv: Typ

source: Delete
sv: Ta bort

source: The content could not be created.
sv: Innehållet kunde inte skapas.

source: content:
sv: innehåll:

source: Create content
sv: Skapa nytt innehåll

source: Create new page here
sv: Skapa en ny sida här

source: Title
sv: Titel

source: Type
sv: Typ

source: This is the clickable link to your post from the archive.
sv: Detta är en klickbar länk till ditt inlägg från arkivlistan.

source: Make a unique key for the post.
sv: Skapa en unik nyckel till ditt inlägg.

source: You can write using various filters.
sv: Du kan använda olika filter för att göra texten säker.

source: post - a blogpost
sv: post - du skapar en bloggpost

source: home - the static homepage
sv: home - startsidan

source: page - any contentpage.
sv: page - en vanlig webbsida

source: byline - one of the footers to the homepage
sv: byline - en av fyra footers till startsidan

source: secret1 - the secret main content
sv: secret1 - huvudinnehåll till hemliga sidan

source: secret2 - the secret sidebar content
sv: secret2 - sidoinnehåll till hemliga sidan

source: footer - one of the footers to the secret page
sv: footer - en av fyra footers till hemliga sidan

source: is simple, but remember that the computer does not recognise how you write the text in the textarea - it just adds all text in a long row.
sv: är enkel och utan filter, men all text kommer att hamna i en enda lång rad.

source: will recognise a new line in your textarea. You can also use
sv: upptäcker radbyten i textfältet. Du kan också använda

source: if you like.
sv: om du vill.

source: is a plugin-filter to use with normal html-tags such as
sv: är ett plugin-filter som används tillsammans med vanliga html-taggar som

source: etc. You cannot use java script with it.
sv: etc. du kan inte använda javascript med det.

source: all the markdown filters need you to learn a special syntax. Try to write
sv: alla markdown filter kräver att du använder en speciell syntax. Prova att skriva

source: To include a photo use this:
sv: För att lägga in en foto skriv så här:

source: The above code is where the image is going to be placed and the address for the image can be written anywhere in your textarea.
sv: Koden ovan skrivs där som bilden ska placeras och adressen för bilden kan sedan placeras var som helst i textfältet.

source: or place your image somewhere else in your tree and refer to that.
sv: eller placera bilden varsomhelst i din trästruktur och referera dit.

source: stands for
sv: står för

source: and the last filter also include the plugin typographer.
sv: och det tredje filtret innehåller även typographer.

source: You can study how to write in this way at
sv: Du kan lära mera om dessa filter hos

source: and at
sv: och hos

source: The groupcreateform could not be processed.
sv: Formuläret för att skapa grupp kunde inte processas.

source: Create group here:
sv: Skapa grupp här:

source: Group id:
sv: Kategori id:

source: The groupeditform could not be processed.
sv: Formuläret för att uppdatera grupp kunde inte processas.

source: Update group
sv: Uppdatera grupp

source: Edit name or acronym here:
sv: Uppdatera namn eller akronym här:

source: Member id:
sv: Kategori id:

source: New email:
sv: Email:

source: The editform could not be processed.
sv: Formuläret för att uppdatera kunde inte processas.

source: Current password:
sv: Nuvarande lösenord:

source: New password:
sv: Nytt lösenord:

source: New password again:
sv: Nytt lösenord igen:

source: Change password
sv: Ändra lösenord

source: Update member:
sv: Uppdatra medlem:

source: Edit name, acronym or email-address here:
sv: Uppdatera namn, akronym eller epost-adress här:

source: Edit password here
sv: Uppdatera lösenordet här:

source: idUser:
sv: Användarid:

source: Name:
sv: Namn:

source: Choose Group to delete:
sv: Välj grupp att ta bort:

source: Delete Group
sv: Ta bort grupp

source: The group could not be chosen.
sv: Gruppen kunde inte väljas.

source: Choose Group to add:
sv: Välj grupp att lägga till:

source: Add Group
sv: Lägg till grupp

source: Edit groupmembership
sv: Uppdatera gruppmedlemsskap

source: Out from group
sv: Ut ur grupp

source: Enter group
sv: In i grupp

source: Your PHP version is:
sv: Din version av PHP är:

source: . Max memory limit is
sv: Maximal minneskapacitet är

source: . Operating system is
sv: . Operativsystemet är

source: You have gettext enabled and can use the multilanguage support.
sv: Du har aktiverat gettext och kan använda översättningsfunktionen.

source: You have NOT gettext enabled and can NOT use the multilanguage support. To use these functions you must download and install the GNU gettext package from » http://www.gnu.org/software/gettext/gettext.html . But you can use the framwork still.
sv: Du har inte aktiverat gettext och har inte tillgång till översättningen. För att använda dessa funktioner behöver du ladda ner och installera paketet med GNU gettext från » http://www.gnu.org/software/gettext/gettext.html . Men ramverket kommer att fungera utan översättning.

source: You have safe mode enabled on this server. Safe mode has been DEPRECATED as of PHP 5.3.0 and REMOVED as of PHP 5.4.0. Turn this off.
sv: Du har aktiverat safe mode på den här servern. Safe mode har tagits bort från och med PHP 5.4.0. Stäng av detta.

source: Safe mode is NOT enabled on this server. Good, as this feature has been DEPRECATED as of PHP 5.3.0 and REMOVED as of PHP 5.4.0.
sv: Safe mode är inte aktiverat på den här servern. Bra, då detta verktyg har tagits bort från PHP 5.4.0.

source: You have PDO enabled and you have SQLite as available driver for PDO.
sv: Du har aktiverat PDO och du har SQLite som en tillgänglig drivrutin för PDO.

source: You have PDO enabled but is lacking support for the SQLite PDO driver. You must fix this.
sv: Du har aktiverat PDO men saknar stöd för SQLite. Detta måste åtgärdas.

source: Database driver PDO is not available. You must fix this.
sv: PDO-drivrutinen för databas är inte tillgänglig. du måste åtgärda detta.

source: You have magic quotes enabled on this server. Fix this.
sv: Du har magic quotes aktiverade på denna server. Inaktivera dem.

source: Magic quotes are disabled. This is good.
sv: Magic quotes är inaktiverade - bra!

source: Your environment does not fully match the need of Siteshop. Go back and correct issues here if you get problems.
sv: Din datamiljö uppfyller inte helt behoven i Siteshop. Kom tillbaka och åtgärda dessa problem om ramverket inte fungerar korrekt.

source: Nice!
sv: Härligt!

source: It seems like this is an environment where Siteshop may enjoy herself.
sv: Det verkar som att du har en datamiljö där Siteshop kommer att fungera väl.

source: Welcome to Siteshop index controller.
sv: Välkommen till Sitehops kontroller-sida

source: This is the index page with all the controllers
sv: Här är index-sidan med alla tillgängliga kontroller.

source: Download
sv: Ladda ner

source: You can download Siteshop from github.
sv: Du kan ladda ner Siteshop från github.

source: You can review its source directly on github:
sv: Du kan också titta på källkoden direkt på github:

source: Now you are ready to check this MVC out.
sv: Nu är du redo att utforska denna MVC.

source: You can always go back to the startup-page by clicking on the startup-link to the right.
sv: Du kan alltid komma tillbaka till uppstartsidan genom att klicka på startup-länken till höger.

source: Welcome to Siteshop framework.
sv: Välkommen till ramverket Sitehop.

source: Controllers and methods
sv: Kontroller och metoder

source: The following controllers exists. You enable and disable controllers in
sv: Följande kontroller finns i ramverket. Du kan aktivera eller inaktivera kontrollerna i

source: To get the framwork nice and going...
sv: För att få ramverket att fungera...

source: you need to do some installations.
sv: behöver du göra några installationer.

source: Go to the
sv: Gå till

source: startup-page
sv: startsidan

source: to continue.
sv: för att fortsätta.

source: Settings for default database is missing in application/config.php.
sv: Inställningar för standard databas saknas i application/config.php.

source: Install Siteshop
sv: Installera Siteshop

source: This is an outdated version of PHP and might mean that Siteshop won't work. Please download a new verion.
sv: Det här är en gammal version av PHP som kan innebära att Siteshop inte fungerar som den ska. Ladda ner en ny version.

source: You have a new enough version of PHP.
sv: Bra, du har en tillräckligt ny version av PHP.

source: Max memory limit is
sv: Maximal minneskapacitet är

source: You have NOT gettext enabled and can NOT use the multilanguage support. To use these functions you must download and install the GNU gettext package from » http://www.gnu.org/software/gettext/gettext.html . But you can use the framework still.
sv: Du har inte aktiverat gettext och har inte tillgång till översättningen. För att använda dessa funktioner behöver du ladda ner och installera paketet med GNU gettext från » http://www.gnu.org/software/gettext/gettext.html . Men ramverket kommer att fungera utan översättning.

source: You have safe mode enabled on this server. Turn this off.
sv: Du har aktiverat safe mode på den här servern. Stäng av detta.

source: Safe mode is NOT enabled on this server. Good!
sv: Safe mode är inte aktiverat. Bra!

source: It's important to have a fairly new version of PHP (min 5.3) for some of the features used in Siteshop. We are testing this here.
sv: Det är viktigt att ha en tillräckligt ny version av PHP (minst 5.3) för att alla verktyg i Siteshop ska fungera. Vi testar det här.

source: We have included a Swedish translation in Siteshop, but to get it working you need to have gettext enabled. We have used Poedit to create the .po and .mo-files.
sv: Vi har inkluderat en översättningsfunktion med översättning till svenska i Siteshop, men för att det ska fungera behöver du aktivera gettext, alternativt ladda ner verktyget och sedan aktivera det. Vi har använt Poedit för att skapa .po och .mo-filerna.

source: Safe mode has been DEPRECATED as of PHP 5.3.0 and REMOVED as of PHP 5.4.0.
sv: Verktyget safe mode har frångåtts från PHP 5.3.0 och tagits bort från PHP 5.4.0.

source: This framework runs with PDO but with PHP version 5.1.0 it should be included.
sv: Detta ramverk körs med PDO. Med en PHP version som är lägst 5.1.0 bör den vara inkluderad.

source: Magic quotes has been DEPRECATED as of PHP 5.3.0 and REMOVED as of PHP 5.4.0.
sv: Man har frångått magic quotes från PHP 5.3.0 och de har tagits bort från PHP 5.4.0.

source: And here is your result:
sv: Här ser du ditt resultat:

source: This is the installation phase.
sv: Det här är installationsfasen.

source: The path to your application-directory is
sv: Sökvägen till din application-katalog är

source: (this is defined in
sv: (den finns definierad i

source: First you have to make the data-directory writable. This is the place where Siteshop needs to be able to write and create files.
sv: Först måste du göra databasens katalog skrivbar. Detta gör att Siteshop kan skriva och skapa filer.

source: Success. The data directory exists and is writable.
sv: Succé! Datakatalogen finns och är skrivbar.

source: Failed. The data directory exists but it is NOT writable.
sv: Fel. Datakatalogen finns, men är inte skrivbar.

source: Correct this by changing the permissions on the directory.
sv: Åtgärda det genom att ändra rättigheterna för katalogen.

source: Failed. The data directory does NOT exist.
sv: Fel. Datakatalogen finns inte.

source: Are you sure that you have the correct SITESHOP_APPLICATION_PATH set in
sv: Är du säker på att du har satt korrekt SITESHOP_APPLICATION_PATH i

source: ? It is currently set to:
sv: ? Den är nu satt till:

source: Try to create the directory.
sv: Försök skapa katalogen.

source: Verify that the default database is available
sv: Verifiera att en förvald databas är aktiverad.

source: Lets check to see if we can connect to the default database.
sv: Låt oss se om vi kan koppla till denna databas.

source: Your default database is (change this in
sv: Din förvalda databas är (ändra i

source: Great, I can connect to the database!
sv: Toppen, jag kan ansluta till databasen!

source: Failed. I can not connect to the database. Review your database connection settings.
sv: Fel. Jag kan inte ansluta till databasen. Kontrollera dina inställningar för databasens anslutningar.

source: Second, Siteshop has some modules that need to be initialized.
sv: Därefter måste du initiera några av Siteshops moduler.

source: When you have done that you can login as root/root for the administrator. At the acp page you can make the changes you prefer.
sv: När det är gjort kan du logga in som administratör med root/root. På acp-sidan kan du göra alla ändringar du behöver.

source: Go back to the index page and start to get to know Siteshop, but first - point your browser to the following link. Enjoy!
sv: Gå tillbaka till indexsidan och börja bekanta dig med Siteshop, men klicka först på följande länk. Mycket nöje!

source: Restricted content
sv: 403, begränsad tillgänglighet till detta innehåll

source: You are trying to reach restricted content.
sv: Du försöker nå en otillåten sida

source: Detailed message:
sv: Mera information:

source: User Control Panel
sv: Kontrollpanelen

source: You do not have privileges to access this content.
sv: Du har inte rättigheter för att komma åt detta innehåll.

source: Acronym:
sv: Akronym:

source: Save
sv: Spara

source: The profile could not be saved.
sv: Profilen kunde inte sparas.

source: Saved profile at
sv: Sparade profilen.

source: Edit profile
sv: Ändra profil

source: Your id:
sv: Din id:

source: The password could not be changed, ensure that all fields match and the current password is correct.
sv: Lösenordet kunde inte ändras. Kontrollera att fälten stämde överens.

source: Saved new password at
sv: Sparade nytt lösenord.

source: Current email adress:
sv: Nuvarande email adress:

source: The email adress could not be saved.
sv: Email-addressen kunde inte sparas.

source: Saved email adress.
sv: Sparade email adressen.

source: Failed to login, user or password does not match.
sv: Kunde inte logga in, användaren eller lösenordet stämde inte.

source: The account could not be created.
sv: Kontot kunde inte skapas.

source: Your have successfully created a new account.
sv: Du har skapat ett nytt konto.

source: All content
sv: Innehåll

source: No content exists.
sv: Det finns inga inlägg.

source: Email adress
sv: Email-address

source: You are member of !number group(s).
sv: Du är medlem i !number grupper.

source: User Controller Index
sv: Indexsida för användarkontrollerna

source: Hi
sv: Hej

source: Check the menu in the upper right corner to logout or to admin if you are authorised.
sv: Gå till menyn i övre högra hörnet för att logga ut eller administrera om du har rättigheter.

source: You can see the secret page here:
sv: Du kan se den hemliga sidan här:

source: The secret page
sv: Hemliga sidan

source: Login using your acronym or email.
sv: Logga in med din användare eller epost.

source: User details
sv: Användar-detaljer

source: You were created at
sv: Du skapades

source: You need admin-privileges to access this content.
sv: Du behöver administratörsrättigheter för att komma åt detta innehållet.

source: You need admin-privileges to access this page.
sv: Du behöver administratörsrättigheter för att komma åt denna sidan.

source: User value matches session.
sv: Användarinformationen matchar sessionen.

source: User conflict between value and session.
sv: Informationen om användaren stämmer inte mellan värde och sessionen.

source: Create new user is disabled by site owner.
sv: Att skapa ny användare är avstängt av webbplatsens administratör.

source: You are just visiting this site and have no profile.
sv: Du är besökare på denna webbplats och har ingen profil.

source: You need to login to access this content.
sv: Du behöver logga in för att komma åt detta innehåll.

source: No such view @viewname.
sv: Det finns ingen sådan vy: '@viewname'.

source: Page is not found. No such content.
sv: Sidan kan inte hittas. Det finns inget sådant innehåll.

source: 404, Page not found
sv: 404, sidan kunde inte hittas

source: The page you are looking for is not here.
sv: Sidan du söker finns inte här.

source: Detailed message: @message
sv: Detaljerad meddelande: @message

source: Page is not found.
sv: Sidan kan inte hittas.

source: 403, restricted content
sv: 403, begränsad tillgänglighet till detta innehåll

source: 404, page not found
sv: 404, sidan kunde inte hittas

source: Header code is not valid.
sv: Header koden är ej giltigt.

source: Theme not enabled.
sv: Temat är inte tillgängligt.

source: View filename is empty.
sv: View filnamn saknas.

source: No such type for adding region to view container: '@type'.
sv: Typen finns inte för att lägga till region till vy-listan: '@type'.
